loadtest.yml
config:
  target: "http://127.0.0.1:8000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load
  # Add payload element when CSV is loaded. 
  payload:
    # Define the coping file and fields to load
    path: "output.csv"
    fields:
     - "cycle.id"
    # Specify sequential if you want to run csv in order from the beginning 
    order: sequence
    # Ignore the first line of the csv
    skipHeader: true
scenarios:
  - name: "Search"
    flow:
      - log: "this yml log, flow: {{ cycle.id }}"
      - post:
          url: "/pivot-csv/transform?loadtest=true"
          json:
            data: {{ cycle.id }}